rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_hci.h"
#include "nrf_delay.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "fds.h"
#include "bsp_btn_ble.h" //includes the nrf_gpio_pin_map() macro
#include "nrf_pwr_mgmt.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
#include "SEGGER_RTT.h"

#include "lsm9ds1.h"
#include "fxos8700.h"
#include "fxas21002.h"
#include "bmi270_drv.h"
#include "bmm150_drv.h"
#include "ble_sensor_service.h"
#include "ble_pc_service.h"
#include "personal_caddie_operating_modes.h"
#include "nRF_Implementations/pc_twi.h"
#include "nRF_Implementations/pc_ble.h"
#include "nRF_Implementations/pc_timer.h"

//Soft Device Parameters
#define DEAD_BEEF                       0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */
BLE_SENSOR_SERVICE_DEF(m_ss);                                                      /**< IMU Sensor Service instance. */
BLE_PC_SERVICE_DEF(m_pc);                                                          /**< Personal Caddie Service instance. */
uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                                  /**< Handle of the current connection. */

//IMU Sensor Parameters
static uint8_t default_sensors[3] = {BMI270_ACC, BMI270_GYR, BMM150_MAG};          /**< Default sensors that are attempted to be initialized first. */
//static uint8_t default_sensors[3] = {FXOS8700_ACC, FXAS21002_GYR, FXOS8700_MAG};
static bool sensors_initialized[3] = {false, false, false};                        /**< Keep track of which sensors are currently initialized */
static uint8_t internal_sensors[10];                                               /**< An array for holding the addresses of sensors on the internal TWI line */
static uint8_t external_sensors[10];                                               /**< An array for holding the addresses of sensors on the external TWI line */
static uint8_t internal_sensors_found = 0;
static uint8_t external_sensors_found = 0;

//IMU Sensor Data Parameters
static uint8_t small_characteristic_data[SMALL_DATA_CHARACTERISTIC_SIZE];           /**< A small array for holding current sensor readings */
static uint8_t medium_characteristic_data[MEDIUM_DATA_CHARACTERISTIC_SIZE];         /**< A medium array for holding current sensor readings */
static uint8_t large_characteristic_data[LARGE_DATA_CHARACTERISTIC_SIZE];           /**< A large array for holding current sensor readings */
static uint8_t* composite_characteristic_data;                                      /**< A pointer to the current data characteristic (changes with number of sensor samples */
uint8_t sensor_settings[SENSOR_SETTINGS_LENGTH];                                    /**< An array represnting the IMU sensor settings */
uint8_t m_current_sensor_samples = 10;                                              /**< The number of sensor samples currently being put into the acc,gy and mag characteristics (must be less than MAX_SENSOR_SAMPLES */
uint32_t m_time_stamp;                                                              /**< Keeps track of the time that each data set is read at (this is measured in ticks of a 16MHz clock, i.e. 1 LSB = 1/16000000s = 62.5ns) */
volatile bool m_data_ready = false;                                                 /**< Indicates when all characteristics have been filled with new data and we're ready to send it to the client  */
bool m_use_composite_data  = true;                                                  /**< If this boolean is true, then all three sensors will have their data put into a single shared characteristic */

//IMU Sensor Communication Parameters
imu_communication_t imu_comm;                                                       /**< Structure that Holds information on how to communicate with each sensor */
uint16_t desired_minimum_connection_interval, desired_maximum_connection_interval;  /**< The desired min and max connection interval */
uint16_t m_connection_interval = 0;                                                 /**< The actuall connection interval of the current connection */
static float current_sensor_odr = 59.5;                                             /**< Keeps track of the current sensor ODR, connection interval is set based on this variable */
volatile bool m_notification_done = true;                                           /**< Indicates the number of notifications sent out in a single connection interval  */
volatile int m_notifications_in_queue = 0;                                          /**< Let's us know the current number of notifications in the queue  */
volatile int m_notification_queue_limit = 1;                                        /**< Limits the number of notifications allowed in the notification queue based on the current sensor ODR and connection interval*/

//LED Pin Parameters
#define RED_LED            NRF_GPIO_PIN_MAP(0, 24)                                  /**< Red LED Indicator on BLE 33 sense (part of triple RGB LED)*/
#define BLUE_LED           NRF_GPIO_PIN_MAP(0, 6)                                   /**< Blue LED Indicator on BLE 33 sense (part of triple RGB LED)*/
#define GREEN_LED          NRF_GPIO_PIN_MAP(0, 16)                                  /**< Green LED Indicator on BLE 33 sense (part of triple RGB LED)*/
#define DARK_GREEN_LED     NRF_GPIO_PIN_MAP(1, 9)                                   /**< Individual Green LED Indicator on BLE 33 sense*/
volatile uint8_t active_led = BLUE_LED;                                             /**< Variable used to keep track of which color LED to turn on/off*/

//Personal Caddie Parameters
static personal_caddie_operating_mode_t current_operating_mode = ADVERTISING_MODE;  /**< The chip starts in advertising mode*/

//Debugging Parameters
int notification_failures = 0;

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    //TODO: Need some kind of custom error handling here, any time this
    //method gets called it results in a crash
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

static void sensor_communication_init(sensor_type_t type, uint8_t model, uint8_t address, nrf_drv_twi_t const * bus)
{
    //This method is used for setting up function pointers for communicating with sensors. Each sensor
    //has slightly different methods for reading and writing (defined in their drivers) so we use the
    //function pointers stored in the imu_comm structure for communication. The imu_comm strucutre also
    //holds other info for communication, such as the address of the sensor and the TWI bus that it's located
    //on.
    switch (type)
    {
        case ACC_SENSOR:
            imu_comm.acc_comm.address = address;
            imu_comm.acc_comm.twi_bus = bus;
            imu_comm.acc_comm.read_register = sensor_read_register;
            imu_comm.acc_comm.write_register = sensor_write_register;
            imu_comm.acc_comm.delay = delay_microseconds;
            if (model == LSM9DS1_ACC)
            {
                imu_comm.acc_comm.update_settings = lsm9ds1_acc_apply_setting; //deprecated
                imu_comm.acc_comm.get_data = lsm9ds1_get_acc_data;
            }
            else if (model == BMI270_ACC)
            {
                if (m_use_composite_data) imu_comm.acc_comm.get_data = bmi270_get_data;
                else imu_comm.acc_comm.get_data = bmi270_get_acc_data;
            }
            else if (model == FXOS8700_ACC)
            {
                imu_comm.acc_comm.update_settings = fxos8700_acc_apply_setting; //deprecated
                imu_comm.acc_comm.get_data = fxos8700_get_acc_data;
            }
            break;
        case GYR_SENSOR:
            imu_comm.gyr_comm.address = address;
            imu_comm.gyr_comm.twi_bus = bus;
            imu_comm.gyr_comm.read_register = sensor_read_register;
            imu_comm.gyr_comm.write_register = sensor_write_register;
            imu_comm.gyr_comm.delay = delay_microseconds;
            if (model == LSM9DS1_GYR)
            {
                imu_comm.gyr_comm.update_settings = lsm9ds1_gyr_apply_setting; //deprecated
                imu_comm.gyr_comm.get_data = lsm9ds1_get_gyr_data;
            }
            else if (model == BMI270_GYR)
            {
                if (m_use_composite_data) imu_comm.gyr_comm.get_data = bmi270_get_dummy_data;
                else imu_comm.gyr_comm.get_data = bmi270_get_gyr_data;
            }
            else if (model == FXAS21002_GYR)
            {
                imu_comm.gyr_comm.update_settings = NULL;  //deprecated
                imu_comm.gyr_comm.get_data = fxas21002_get_gyr_data;
            }
            break;
        case MAG_SENSOR:
            imu_comm.mag_comm.address = address;
            imu_comm.mag_comm.twi_bus = bus;
            imu_comm.mag_comm.read_register = sensor_read_register;
            imu_comm.mag_comm.write_register = sensor_write_register;
            imu_comm.mag_comm.delay = delay_microseconds;
            if (model == LSM9DS1_MAG)
            {
                imu_comm.mag_comm.update_settings = lsm9ds1_mag_apply_setting;  //deprecated
                imu_comm.mag_comm.get_data = lsm9ds1_get_mag_data;
            }
            else if (model == BMM150_MAG)
            {
                imu_comm.mag_comm.get_data = bmm150_get_data;
            }
            else if (model == FXOS8700_MAG)
            {
                imu_comm.mag_comm.update_settings = fxos8700_mag_apply_setting;  //deprecated
                imu_comm.mag_comm.get_data = fxos8700_get_mag_data;
            }
            break;
    }
}

static float sensor_odr_calculate()
{
    //Calculates the highest ODR of the three active sensors. The highest ODR
    //value will dictate the appropriate connection interval for the BLE connection.
    float current_highest_odr = 0.0;

    for (int i = 0; i < 3; i++)
    {
        if (imu_comm.sensor_model[i] == LSM9DS1_ACC)
        {
            float new_odr = lsm9ds1_odr_calculate(sensor_settings, imu_comm.sensor_model[0], imu_comm.sensor_model[1], imu_comm.sensor_model[2], i);
            if (new_odr > current_highest_odr) current_highest_odr = new_odr;
        }
        else if (imu_comm.sensor_model[i] == FXOS8700_ACC)
        {
            float new_odr;

            if (i == GYR_SENSOR) new_odr = fxas21002_odr_calculate(imu_comm.sensor_model[1], sensor_settings[GYR_START + ODR]);
            else new_odr = fxos8700_odr_calculate(imu_comm.sensor_model[0], imu_comm.sensor_model[2], sensor_settings[ACC_START + ODR], sensor_settings[MAG_START + ODR]);
            
            if (new_odr > current_highest_odr) current_highest_odr = new_odr;
        }
        else if (imu_comm.sensor_model[i] == BMI270_ACC)
        {
            float new_odr = bmi_bmm_odr_calculate(imu_comm.sensor_model[0], imu_comm.sensor_model[1], imu_comm.sensor_model[2], sensor_settings);
            if (new_odr > current_highest_odr) current_highest_odr = new_odr;
        }
    }

    return current_highest_odr;
}

