rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
static void error_notification(int err_code)
{
    //This method is used to alert the front end application of nRF errors that have occured.
    //This happens by putting the error code into a characteristic and sending it via a
    //notification.
    ble_gatts_hvx_params_t err_notify_params;
    memset(&err_notify_params, 0, sizeof(err_notify_params));

    uint16_t err_characteristic_size = 4; //currently only error codes less than or equal to 4 bytes can be sent

    //Convert the error code into a byte array
    uint8_t err_array[4];
    uint8_t* err_start = (uint8_t*)&err_code; //cast the float to a 32-bit integer to take up 4 array slots
    for (int i = 0; i < 4; i++) err_array[i] = *(err_start + i);

    //Setup accelerometer notification first
    err_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    err_notify_params.handle = m_pc.error_handle.value_handle;
    err_notify_params.p_data = err_array;
    err_notify_params.p_len  = &err_characteristic_size;
    err_notify_params.offset = 0;

    uint32_t ret = sd_ble_gatts_hvx(m_conn_handle, &err_notify_params); //acc data notification
    APP_ERROR_CHECK(ret);
}

static uint32_t data_notification_error_handler(uint32_t* ret)
{
    //This method is for handling common errors that happen during notification
    //can be handled without crashing the application.
    if (*ret == BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    {
        //This error will pop up during a secure connection when we aren't sure who
        //the sender is (this happens when we try to send notifications without first
        //setting the CCCD to notify from the app). Calling the below method should fix
        //things.
        *ret = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
    }
    else if (*ret == NRF_ERROR_RESOURCES)
    {
        //This error occurs when we try to add a notification to the queue when the queue
        //is full. The m_notifications_in_queue variable of this file should prevent
        //this error code from occuring, so if it does occur it's indicative of some bigger
        //failure elsewhere. We don't want this to crash our program so we return a custom
        //error code.
        SEGGER_RTT_WriteString(0, "Error: Notification queue is full, waiting for it to empty.\n");
        *ret = 0x69;
    }

    return 0;
}

static void characteristic_update_and_notify_composite_characteristic()
{
    //Add data to the appropriate characteristic based on the number of 
    //samples we're collecting (which is a factor of the current sensor
    //ODR and BLE connection interval).
    uint16_t data_characteristic_size, characteristic_handle;
    if (composite_characteristic_data == small_characteristic_data)
    {
        data_characteristic_size = SMALL_DATA_CHARACTERISTIC_SIZE; //5 bytes for time and samples + 4 samples max * 6 bytes/sample * 3 sensors
        characteristic_handle = m_ss.data_handles[0].value_handle;
    }
    else if (composite_characteristic_data == medium_characteristic_data)
    {
        data_characteristic_size = MEDIUM_DATA_CHARACTERISTIC_SIZE; //5 bytes for time and samples + 8 samples max * 6 bytes/sample * 3 sensors
        characteristic_handle = m_ss.data_handles[1].value_handle;
    }
    else
    {
        data_characteristic_size = LARGE_DATA_CHARACTERISTIC_SIZE; //5 bytes for time and samples + 13 samples max * 6 bytes/sample * 3 sensors
        characteristic_handle = m_ss.data_handles[2].value_handle;
    }

    //Add the time stamp for the current data set and current number of 
    //samples to the beginning of the characteristic.
    uint8_t* time_start = (uint8_t*)&m_time_stamp; //cast the float to a 32-bit integer to take up 4 array slots
    for (int i = 0; i < 4; i++) composite_characteristic_data[i] = *(time_start + i);
    composite_characteristic_data[4] = m_current_sensor_samples;

    //Setup composite data notification
    ble_gatts_hvx_params_t data_notify_params;
    memset(&data_notify_params, 0, sizeof(data_notify_params));
    
    data_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
    data_notify_params.handle = characteristic_handle;
    data_notify_params.p_data = composite_characteristic_data;
    data_notify_params.p_len  = &data_characteristic_size;
    data_notify_params.offset = 0;

    //Attempt to add the notification to the notification queue. During times
    //of heavy BLE traffic, this queue may fill up at higher sensor ODRs so if
    //the queue is full don't add the current data set. Newer data will get
    //added as the queue empties out.
    uint32_t ret = 0;
    ret = sd_ble_gatts_hvx(m_conn_handle, &data_notify_params);
    data_notification_error_handler(&ret);

    if (ret == 0x69) return;
    m_notifications_in_queue++;

    //SEGGER_RTT_printf(0, "Queue has %d notifications in it.\n", m_notifications_in_queue);
}

static void characteristic_update_and_notify_individual_characteristics()
{
//    //Add the time stamp for the current data set and current number of 
//    //samples to the end of each of the data characteristics.
//    for (int i = 0; i < 4; i++)
//    {
//        uint8_t* time_start = (uint8_t*)&m_time_stamp; //cast the float to a 32-bit integer to take up 4 array slots

//        acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
//        gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
//        mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + i] = *(time_start + i);
//    }

//    acc_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
//    gyr_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;
//    mag_characteristic_data[MAX_SENSOR_SAMPLES * SAMPLE_SIZE + 4] = m_current_sensor_samples;

//    ble_gatts_hvx_params_t acc_notify_params, gyr_notify_params, mag_notify_params;
//    memset(&acc_notify_params, 0, sizeof(acc_notify_params));
//    memset(&gyr_notify_params, 0, sizeof(gyr_notify_params));
//    memset(&mag_notify_params, 0, sizeof(mag_notify_params));

//    //uint16_t acc_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;
//    uint16_t acc_data_characteristic_size = 5;
//    uint16_t gyr_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;
//    uint16_t mag_data_characteristic_size = 5 + MAX_SENSOR_SAMPLES * SAMPLE_SIZE;

//    //Setup accelerometer notification first
//    acc_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
//    acc_notify_params.handle = m_ss.data_handles[0].value_handle;
//    acc_notify_params.p_data = acc_characteristic_data;
//    acc_notify_params.p_len  = &acc_data_characteristic_size;
//    acc_notify_params.offset = 0;

//    //Setup gyroscope notification second
//    gyr_notify_params.type = BLE_GATT_HVX_NOTIFICATION;
//    gyr_notify_params.handle = m_ss.data_handles[1].value_handle;
//    gyr_notify_params.p_data = gyr_characteristic_data;
//    gyr_notify_params.p_len  = &gyr_data_characteristic_size;
//    gyr_notify_params.offset = 0;

