rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
    current_operating_mode = SENSOR_ACTIVE_MODE; //set the current operating mode to active
    m_data_ready = false; //Want to make sure we start with fresh data
    SEGGER_RTT_WriteString(0, "Sensor Active Mode engaged.\n");
}

static void connected_mode_start()
{
    //There are two ways to enter connected mode. We either enter this mode when a connection is
    //first established, or when we navigate to one of the menu screens in the front end. In the 
    //case where the connection is first established, we use this opportunity to initialize any
    //sensors that need an initialization (as of this writing only the BMI/BMM sensors require
    //this). After this initialization is complete, or if connected mode is entered via menu
    //navigation in the front end, we make sure that any active sensors are placed into sleep mode
    //and that any TWI busses are turned off. We also change the on-board blinking LED to green.
    if (current_operating_mode == CONNECTED_MODE) return; //no need to change anything if already in connected mode

    bool bmi270_init = false, bmm150_init = false;
    if (current_operating_mode == ADVERTISING_MODE)
    {
        //all of the connected_mode_enabled() methods require the TWI bus(es) to be
        //on. These buses shouldn't be on when going from advertising mode to 
        //connected mode so turn them on now to avoid any TWI errors being thrown.
        enable_twi_bus(imu_comm.acc_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.gyr_comm.twi_bus->inst_idx);
        enable_twi_bus(imu_comm.mag_comm.twi_bus->inst_idx);

        //If any BMI/BMM sensors are selected they will need to be configured before
        //they can be used. Setting the necessary booleans to true will allow this
        //configuration to occur.
        if (default_sensors[0] == BMI270_ACC || default_sensors[1] == BMI270_GYR) bmi270_init = true; 
        if (default_sensors[2] == BMM150_MAG) bmm150_init = true;
    }

    //Call the connected_mode_enable() method for all sensors. Only sensors that are in active
    //use will actually do anything with these methods
    bmi270_connected_mode_enable(bmi270_init);
    bmm150_connected_mode_enable(bmm150_init);
    fxos8700_connected_mode_enable();
    fxas21002_connected_mode_enable();
    lsm9ds1_connected_mode_enable();

    //Disable all active TWI busses
    disable_twi_bus(imu_comm.acc_comm.twi_bus->inst_idx);
    disable_twi_bus(imu_comm.gyr_comm.twi_bus->inst_idx);
    disable_twi_bus(imu_comm.mag_comm.twi_bus->inst_idx);

    //change the color of the blinking LED to green, also make sure that the red
    //and blue LEDs are off. If we're coming here from sensor active mode then 
    //we're going to need to turn on the LED first and also deactivate the data timer
    if (current_operating_mode == SENSOR_ACTIVE_MODE)
    {
        data_timers_stop();
        led_timers_start();
    }

    active_led = GREEN_LED;
    nrf_gpio_pin_set(RED_LED); //LEDs must be set high to turn off
    nrf_gpio_pin_set(BLUE_LED); //LEDs must be set high to turn off

    current_operating_mode = CONNECTED_MODE; //set the current operating mode to idle
    SEGGER_RTT_WriteString(0, "Connected Mode engaged.\n");
}

static void advertising_mode_start()
{
    //There are two ways to get into advertising mode, either by turning the device on,
    //or by losing a connection to a central device (whether this is intentional or 
    //accidental). In the latter case, we need to disable any sensors or peripherals
    //to save on power.

    switch (current_operating_mode)
    {
        case ADVERTISING_MODE:
            return; //no changes need to be made so leave the method
        case SENSOR_ACTIVE_MODE:
            sensor_idle_mode_start();
            //break statement purposely omitted here
        case SENSOR_IDLE_MODE:
            connected_mode_start();
            //break statement purposely omitted here
        default:
            active_led = BLUE_LED;
            nrf_gpio_pin_set(RED_LED); //LEDs must be set high to turn off
            nrf_gpio_pin_set(GREEN_LED); //LEDs must be set high to turn off
            break;
    }

    current_operating_mode = ADVERTISING_MODE; //set the current operating mode to idle
    
    //finally, we need to terminate the existing connection
    //TODO: Implement this feature
}

static void update_sensor_settings_array()
{
    //This method gets called when the sensor settings array is updated in the front end.
    //For the most part all we do here is apply the new settings to the physical array
    //stored in this file, however, depending on the new settings coming in there may be
    //a few other things to change. For example, if a new ODR for a sensor is selected
    //then we'll need to adjust the data reading timer.

    //See if a new sensor was selected for use. If so we need to uninitialize the current
    //sensor and initialize the new one.
    uint8_t new_sensors = 0;

    if (imu_comm.sensor_model[ACC_SENSOR] != sensor_settings[ACC_START + SENSOR_MODEL])
    {
        new_sensors |= 0b001;
        default_sensors[ACC_SENSOR] = sensor_settings[ACC_START + SENSOR_MODEL];
        sensors_initialized[ACC_SENSOR] = false;
    }

    if (imu_comm.sensor_model[GYR_SENSOR] != sensor_settings[GYR_START + SENSOR_MODEL])
    {
        new_sensors |= 0b010;
        default_sensors[GYR_SENSOR] = sensor_settings[GYR_START + SENSOR_MODEL];
        sensors_initialized[GYR_SENSOR] = false;
    }
    
    if (imu_comm.sensor_model[MAG_SENSOR] != sensor_settings[MAG_START + SENSOR_MODEL])
    {
        new_sensors |= 0b100;
        default_sensors[MAG_SENSOR] = sensor_settings[MAG_START + SENSOR_MODEL];
        sensors_initialized[MAG_SENSOR] = false;
    }

    if (new_sensors) sensors_init(false);

    //Check to see if the ODR was updated. If so we update the data reading timer
    //and update the connection interval accordingly.
    float new_sensor_odr = sensor_odr_calculate();
    
    if (new_sensor_odr != current_sensor_odr)
    {
        //NOTE: I no longer change the connection interval to match the current sensor
        //ODR. I'm leaving this code like this though in the event I ever want to 
        //go back.
        //float temp = current_sensor_odr; //save the original odr in case something goes wrong
        //
        //uint32_t err_code = update_connection_interval();
        //if (err_code != NRF_SUCCESS)
        //{
        //    current_sensor_odr = temp; //reset the sensor odr as it wasn't actually updated
        //    SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
        //    error_notification(err_code);
        //}
        //else
        //{
           
        //}
        current_sensor_odr = new_sensor_odr; //update the ODR;

        //If the sensor ODR has changed then we need to check if it would be 
        //more efficient to store more samples in the data characteristic. We
        //also need to update the data acquisition timer to math the ODR.
        update_data_read_timer(1000.0 / current_sensor_odr);
        set_sensor_samples(0); //using 0 here forces the method to use the current connection interval
    }
}

