rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
/**@brief Function for handling write events to the Sensor Settings Characteristic.
 *
 * @param[in] p_lbs     Instance of Sensor Settings Service to which the write applies.
 * @param[in] led_state Written/desired state for the sensor settings.
 */
static void sensor_settings_write_handler(uint16_t conn_handle, ble_sensor_service_t * p_ss, const uint8_t* settings_state)
{
    //Different things can happen depending on what gets written to the settings characteristic
    switch (*settings_state)
    {
        case 0:
            advertising_mode_start();
            break;
        case 1:
            connected_mode_start();
            break;
        case 2:
            sensor_idle_mode_start();
            break;
        case 3:
            for (int i = 1; i < SENSOR_SETTINGS_LENGTH; i++) sensor_settings[i] = *(settings_state + i);
            update_sensor_settings_array();
            break;
        case 4:
            sensor_settings[*(settings_state + 1)] = *(settings_state + 2);
            sensor_idle_mode_start();
            break;
        case 5:
            sensor_active_mode_start();
            break;
    }    
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t                err_code;
    ble_sensor_service_init_t init  = {0};

    // Initialize sensor service
    init.setting_write_handler = sensor_settings_write_handler;

    err_code = ble_sensor_service_init(&m_ss, &init, SENSOR_SETTINGS_LENGTH);
    APP_ERROR_CHECK(err_code);

    err_code = ble_pc_service_init(&m_pc);
    APP_ERROR_CHECK(err_code);
}


void on_gap_connection_handler()
{
    //This handler method gets called every time a new connection is initiated
    connected_mode_start();
    float new_sensor_odr = sensor_odr_calculate();
    if (new_sensor_odr != current_sensor_odr)
    {
        float temp = current_sensor_odr; //save the original odr in case something goes wrong
        current_sensor_odr = new_sensor_odr;
        uint32_t err_code = update_connection_interval();
        if (err_code != NRF_SUCCESS)
        {
            current_sensor_odr = temp; //reset the sensor odr as it wasn't actually updated
            SEGGER_RTT_WriteString(0, "Couldn't update connection interval.\n");
            error_notification(err_code);
        }
        else
        {
            //If the change was successful we also need to update the data
            //aquisition timer to reflect this new odr
            update_data_read_timer(1000.0 / current_sensor_odr);
        }
    }
}

void on_gap_disconnection_handler()
{
    //This handler method gets called when a connection is lost
    advertising_mode_start();
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


static void leds_init()
{
    //configure the pins for the BLE 33 Sense on-board red, green and blue tri-colored LED.
    nrf_gpio_cfg_output(RED_LED);
    nrf_gpio_cfg_output(BLUE_LED);
    nrf_gpio_cfg_output(GREEN_LED);
    nrf_gpio_cfg_output(DARK_GREEN_LED);

    //these LEDs are situated backwards from what you would expect so the pin needs to be 
    //pulled high for the LEDs to turn off
    nrf_gpio_pin_set(RED_LED);
    nrf_gpio_pin_set(BLUE_LED);
    nrf_gpio_pin_set(GREEN_LED);

    //The single green LED doesn't get used due to higher current draw than the 3 RGB LEDs.
    //Make sure its GPIO pin isn't floating to reduced current leak
    nrf_gpio_pin_clear(DARK_GREEN_LED);
}

static void power_saving_init()
{
    //This method implements certain power saving techniques that I've discovered
    //with my time using the SDK

    //enable the DCDC regulators
    uint32_t err_code = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
    APP_ERROR_CHECK(err_code);

    //Voltage Regulator 0 can only be enabled if the nRF52840 is being run
    //in High Voltage mode. This requires a voltage > 3.6V to be supplied to
    //the VDDH pin (which won't be the case when running from a coin cell battery).
    err_code = sd_power_dcdc0_mode_set(NRF_POWER_DCDC_ENABLE);
    APP_ERROR_CHECK(err_code);

    SEGGER_RTT_WriteString(0, "DCDC Engaged.\n");

    turn_off_mic(); //used for lowering overall power consumption (prevents GPIO pin from floating)
}

/**@brief Function for application main entry.
 */
int main(void)
 {
    bool erase_bonds;

    //Create structures for handler methods
    ble_event_handler_t ble_handlers;
    ble_handlers.gap_connected_handler = on_gap_connection_handler;
    ble_handlers.gap_disconnected_handler = on_gap_disconnection_handler;
    ble_handlers.gap_connection_interval_handler = calculate_samples_and_connection_interval;
    ble_handlers.gap_update_sensor_samples = set_sensor_samples;

    timer_handlers_t timer_handlers;
    timer_handlers.data_read_handler = data_read_handler;
    timer_handlers.error_handler = error_notification;

    //Initialize.
    log_init();
    timers_init(&active_led, &m_data_ready, &m_current_sensor_samples, &m_time_stamp, &timer_handlers);
    power_management_init();
    ble_stack_init(&ble_handlers, &m_conn_handle, &m_notification_done, &m_notifications_in_queue, &m_current_sensor_samples, &desired_minimum_connection_interval, &desired_maximum_connection_interval);
    enable_connection_event_extension();
    gatt_init();
    services_init();
    twi_init();
    sensors_init(true);
    gap_params_init(current_sensor_odr);
    advertising_init();
    conn_params_init();
    peer_manager_init();
    leds_init();
    power_saving_init();

    //Start execution.
    led_timers_start();
    advertising_start(erase_bonds);

    //Enter main loop.
    for (;;)
    {
        idle_state_handle(); //puts CPU into sleep and waits for an event signal to wake it up

        //after the CPU get's woken up (at a minimum this should happen once every
        //connection interval), see if the data ready flag has been set to true and
        //if so, send out data notifications).
        if (m_data_ready)
        {
            characteristic_update_and_notify();
            m_data_ready = false;
        }
    }
}